In [1]:
import pandas as pd
import numpy as np

In [2]:
movies = pd.read_csv("dataset/movies.csv")
movies.head()

,Unnamed: 0,id,budget,popularity,revenue,title,vote_average,vote_count,director_id,year,month,day
0,0,43597,237000000,150,2787965087,Avatar,7.2,11800,4762,2009,Dec,Thursday
1,1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,4763,2007,May,Saturday
2,2,43599,245000000,107,880674609,Spectre,6.3,4466,4764,2015,Oct,Monday
3,3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,4765,2012,Jul,Monday
4,5,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,4767,2007,May,Tuesday

In [3]:
directors = pd.read_csv("dataset/directors.csv")
directors.head()

   Unnamed: 0      director_name    id gender
0           0      James Cameron  4762   Male
1           1     Gore Verbinski  4763   Male
2           2         Sam Mendes  4764   Male
3           3  Christopher Nolan  4765   Male
4           4     Andrew Stanton  4766   Male

In [4]:
movies.drop(["Unnamed: 0"], axis = 1, inplace=True)
movies.head()

,id,budget,popularity,revenue,title,vote_average,vote_count,director_id,year,month,day
0,43597,237000000,150,2787965087,Avatar,7.2,11800,4762,2009,Dec,Thursday
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,4763,2007,May,Saturday
2,43599,245000000,107,880674609,Spectre,6.3,4466,4764,2015,Oct,Monday
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,4765,2012,Jul,Monday
4,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,4767,2007,May,Tuesday

In [5]:
directors.drop(["Unnamed: 0"], axis = 1, inplace = True)
directors.head()

       director_name    id gender
0      James Cameron  4762   Male
1     Gore Verbinski  4763   Male
2         Sam Mendes  4764   Male
3  Christopher Nolan  4765   Male
4     Andrew Stanton  4766   Male

In [6]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1465 entries, 0 to 1464
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1465 non-null   int64
 1   budget        1465 non-null   int64
 2   popularity    1465 non-null   int64
 3   revenue       1465 non-null   int64
 4   title         1465 non-null   object
 5   vote_average  1465 non-null   float64
 6   vote_count    1465 non-null   int64
 7   director_id   1465 non-null   int64
 8   year          1465 non-null   int64
 9   month         1465 non-null   object
 10  day           1465 non-null   object
dtypes: float64(1), int64(7), object(3)
memory usage: 126.0+ KB

In [7]:
directors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2349 entries, 0 to 2348
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   director_name  2349 non-null   object
 1   id             2349 non-null   int64
 2   gender         1724 non-null   object
dtypes: int64(1), object(2)
memory usage: 55.2+ KB

In [8]:
movies.describe()

,id,budget,popularity,revenue,vote_average,vote_count,director_id,year
count,1465.000000,1.465000e+03,1465.000000,1.465000e+03,1465.000000,1465.000000,1465.000000,1465.000000
mean,45225.191126,4.802295e+07,30.855973,1.432539e+08,6.368191,1146.396587,5040.192491,2002.615017
std,1189.096396,4.935541e+07,34.845214,2.064918e+08,0.818033,1578.077438,258.059631,8.680141
min,43597.000000,0.000000e+00,0.000000,0.000000e+00,3.000000,1.000000,4762.000000,1976.000000
25%,44236.000000,1.400000e+07,11.000000,1.738013e+07,5.900000,216.000000,4845.000000,1998.000000
50%,45022.000000,3.300000e+07,23.000000,7.578164e+07,6.400000,571.000000,4964.000000,2004.000000
75%,45990.000000,6.600000e+07,41.000000,1.792469e+08,6.900000,1387.000000,5179.000000,2009.000000
max,48395.000000,3.800000e+08,724.000000,2.787965e+09,8.300000,13752.000000,6204.000000,2016.000000

In [9]:
movies.describe(include = object)

         title month     day
count     1465  1465    1465
unique    1465    12       7
top     Avatar   Dec  Friday
freq         1   193     654

In [11]:
directors.describe(include = object)

        director_name gender
count            2349   1724
unique           2349      2
top     James Cameron   Male
freq                1   1574

In [12]:
movies.nunique()

id              1465
budget           201
popularity       128
revenue         1267
title           1465
vote_average      51
vote_count      1019
director_id      199
year              41
month             12
day                7
dtype: int64

In [13]:
directors.nunique()

director_name    2349
id               2349
gender              2
dtype: int64

In [23]:
# Merging 2 dataset
data = movies.merge(directors, left_on = "director_id", right_on = 'id', how = "left")
data.head()

,id_x,budget,popularity,revenue,title,vote_average,vote_count,director_id,year,month,day,director_name,id_y,gender
0,43597,237000000,150,2787965087,Avatar,7.2,11800,4762,2009,Dec,Thursday,James Cameron,4762,Male
1,43598,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,4763,2007,May,Saturday,Gore Verbinski,4763,Male
2,43599,245000000,107,880674609,Spectre,6.3,4466,4764,2015,Oct,Monday,Sam Mendes,4764,Male
3,43600,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,4765,2012,Jul,Monday,Christopher Nolan,4765,Male
4,43602,258000000,115,890871626,Spider-Man 3,5.9,3576,4767,2007,May,Tuesday,Sam Raimi,4767,Male

In [24]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1465 entries, 0 to 1464
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id_x           1465 non-null   int64
 1   budget         1465 non-null   int64
 2   popularity     1465 non-null   int64
 3   revenue        1465 non-null   int64
 4   title          1465 non-null   object
 5   vote_average   1465 non-null   float64
 6   vote_count     1465 non-null   int64
 7   director_id    1465 non-null   int64
 8   year           1465 non-null   int64
 9   month          1465 non-null   object
 10  day            1465 non-null   object
 11  director_name  1465 non-null   object
 12  id_y           1465 non-null   int64
 13  gender         1341 non-null   object
dtypes: float64(1), int64(8), object(5)
memory usage: 171.7+ KB

In [25]:
data.drop(["id_x", "id_y", "director_id"], axis = 1, inplace = True)

In [26]:
data.head()

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,237000000,150,2787965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male
1,300000000,139,961000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,Male
2,245000000,107,880674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,Male
3,250000000,112,1084939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male
4,258000000,115,890871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,Male

In [27]:
data.tail()

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
1460,0,3,321952,The Last Waltz,7.9,64,1978,May,Monday,Martin Scorsese,Male
1461,27000,19,3151130,Clerks,7.4,755,1994,Sep,Tuesday,Kevin Smith,Male
1462,0,7,0,Rampage,6.0,131,2009,Aug,Friday,Uwe Boll,Male
1463,0,3,0,Slacker,6.4,77,1990,Jul,Friday,Richard Linklater,Male
1464,220000,14,2040920,El Mariachi,6.6,238,1992,Sep,Friday,Robert Rodriguez,NaN

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1465 entries, 0 to 1464
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   budget         1465 non-null   int64
 1   popularity     1465 non-null   int64
 2   revenue        1465 non-null   int64
 3   title          1465 non-null   object
 4   vote_average   1465 non-null   float64
 5   vote_count     1465 non-null   int64
 6   year           1465 non-null   int64
 7   month          1465 non-null   object
 8   day            1465 non-null   object
 9   director_name  1465 non-null   object
 10  gender         1341 non-null   object
dtypes: float64(1), int64(5), object(5)
memory usage: 137.3+ KB

In [29]:
movies["director_id"].isin(directors["id"])

0       True
1       True
2       True
3       True
4       True
        ...
1460    True
1461    True
1462    True
1463    True
1464    True
Name: director_id, Length: 1465, dtype: bool

In [30]:
np.all(movies["director_id"].isin(directors["id"]))

True

In [31]:
data.describe()

,budget,popularity,revenue,vote_average,vote_count,year
count,1.465000e+03,1465.000000,1.465000e+03,1465.000000,1465.000000,1465.000000
mean,4.802295e+07,30.855973,1.432539e+08,6.368191,1146.396587,2002.615017
std,4.935541e+07,34.845214,2.064918e+08,0.818033,1578.077438,8.680141
min,0.000000e+00,0.000000,0.000000e+00,3.000000,1.000000,1976.000000
25%,1.400000e+07,11.000000,1.738013e+07,5.900000,216.000000,1998.000000
50%,3.300000e+07,23.000000,7.578164e+07,6.400000,571.000000,2004.000000
75%,6.600000e+07,41.000000,1.792469e+08,6.900000,1387.000000,2009.000000
max,3.800000e+08,724.000000,2.787965e+09,8.300000,13752.000000,2016.000000

In [32]:
data.describe(include = object)

         title month     day     director_name gender
count     1465  1465    1465              1465   1341
unique    1465    12       7               199      2
top     Avatar   Dec  Friday  Steven Spielberg   Male
freq         1   193     654                26   1309

In [34]:
movies["director_id"].nunique()

199

In [35]:
data["revenue"] = data["revenue"] / 1000000 # Revenue in Million dollor

In [36]:
data.head()

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,237000000,150,2787.965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male
1,300000000,139,961.000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,Male
2,245000000,107,880.674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,Male
3,250000000,112,1084.939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male
4,258000000,115,890.871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,Male

In [37]:
data["budget"] = data["budget"] / 1000000 # Budget in Million dollor

In [38]:
data.head()

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,237.0,150,2787.965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male
1,300.0,139,961.000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,Male
2,245.0,107,880.674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,Male
3,250.0,112,1084.939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male
4,258.0,115,890.871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,Male

In [39]:
# Querying the dataframe

data["vote_average"] >= 7

0        True
1       False
2       False
3        True
4       False
        ...
1460     True
1461     True
1462    False
1463    False
1464    False
Name: vote_average, Length: 1465, dtype: bool

In [41]:
data.loc[data["vote_average"] >= 7, : ]

# data[data["vote_average"] >= 7] # not recommened
# syntax not making clear whether it is using explcity or implcity infices

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,237.000,150,2787.965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,Male
3,250.000,112,1084.939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,Male
8,200.000,145,1065.659812,Pirates of the Caribbean: Dead Man's Chest,7.0,5246,2006,Jun,Tuesday,Gore Verbinski,Male
14,250.000,120,956.019788,The Hobbit: The Battle of the Five Armies,7.1,4760,2014,Dec,Wednesday,Peter Jackson,Male
16,250.000,94,958.400000,The Hobbit: The Desolation of Smaug,7.6,4524,2013,Dec,Wednesday,Peter Jackson,Male
...,...,...,...,...,...,...,...,...,...,...,...
1456,0.010,20,7.000000,Eraserhead,7.5,485,1977,Mar,Saturday,David Lynch,Male
1457,0.000,5,0.000000,The Mighty,7.1,51,1998,Oct,Friday,Peter Chelsom,Male
1458,0.060,27,3.221152,Pi,7.1,586,1998,Jul,Friday,Darren Aronofsky,Male
1460,0.000,3,0.321952,The Last Waltz,7.9,64,1978,May,Monday,Martin Scorsese,Male
1461,0.027,19,3.151130,Clerks,7.4,755,1994,Sep,Tuesday,Kevin Smith,Male

In [42]:
data.loc[data["vote_average"] >= 7, ["title", "director_name"]]

                                           title      director_name
0                                         Avatar      James Cameron
3                          The Dark Knight Rises  Christopher Nolan
8     Pirates of the Caribbean: Dead Man's Chest     Gore Verbinski
14     The Hobbit: The Battle of the Five Armies      Peter Jackson
16           The Hobbit: The Desolation of Smaug      Peter Jackson
...                                          ...                ...
1456                                  Eraserhead        David Lynch
1457                                  The Mighty      Peter Chelsom
1458                                          Pi   Darren Aronofsky
1460                              The Last Waltz    Martin Scorsese
1461                                      Clerks        Kevin Smith

[363 rows x 2 columns]

In [43]:
# give title and director name for highly rated movies which were released in or after 2015
data.loc[(data["vote_average"]>=7) & (data["year"] >= 2015), ["title", "director_name"]]

                                          title                director_name
30                                    Furious 7                    James Wan
78                           Mad Max: Fury Road                George Miller
106                                The Revenant  Alejandro Gonzlez Irritu
162                                 The Martian                 Ridley Scott
312                     The Man from U.N.C.L.E.                  Guy Ritchie
394                           The Hateful Eight            Quentin Tarantino
519   13 Hours: The Secret Soldiers of Benghazi                  Michael Bay
617                             The Conjuring 2                    James Wan
625                                  The Intern                 Nancy Meyers
635                             Bridge of Spies             Steven Spielberg
808                                    Southpaw                Antoine Fuqua
833                      Straight Outta Compton                 F. Gary Gray
839                               The Big Short                   Adam McKay
1344                                       Race              Stephen Hopkins

In [46]:
# Find me rows corresponding top 5 popular movies

data.sort_values(["popularity"], ascending = False).head(5)

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
58,165.0,724,675.120017,Interstellar,8.1,10867,2014,Nov,Wednesday,Christopher Nolan,Male
78,150.0,434,378.858340,Mad Max: Fury Road,7.2,9427,2015,May,Wednesday,George Miller,Male
119,140.0,271,655.011224,Pirates of the Caribbean: The Curse of the Bla...,7.5,6985,2003,Jul,Wednesday,Gore Verbinski,Male
120,125.0,206,752.100229,The Hunger Games: Mockingjay - Part 1,6.6,5584,2014,Nov,Tuesday,Francis Lawrence,Male
45,185.0,187,1004.558444,The Dark Knight,8.2,12002,2008,Jul,Wednesday,Christopher Nolan,Male

In [49]:
# title for all the movies directed by "Christopher Nolan"

data.loc[data["director_name"] == "Steven Spielberg", ["title"]].head(5)

                                                 title
37   Indiana Jones and the Kingdom of the Crystal S...
105                                            The BFG
110                                  War of the Worlds
114                           The Adventures of Tintin
166                                    Minority Report

In [53]:
# apply
# gender --> Male, Female (0, 1)
# ML Algos want all the features to be numerical

def encode(gender):
    if gender == "Male":
        return 0
    elif gender == "Female":
        return 1
    else:
        return gender

In [57]:
data["gender"] = data["gender"].apply(encode)
data

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender
0,237.000,150,2787.965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,0.0
1,300.000,139,961.000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,0.0
2,245.000,107,880.674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,0.0
3,250.000,112,1084.939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,0.0
4,258.000,115,890.871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,0.0
...,...,...,...,...,...,...,...,...,...,...,...
1460,0.000,3,0.321952,The Last Waltz,7.9,64,1978,May,Monday,Martin Scorsese,0.0
1461,0.027,19,3.151130,Clerks,7.4,755,1994,Sep,Tuesday,Kevin Smith,0.0
1462,0.000,7,0.000000,Rampage,6.0,131,2009,Aug,Friday,Uwe Boll,0.0
1463,0.000,3,0.000000,Slacker,6.4,77,1990,Jul,Friday,Richard Linklater,0.0
1464,0.220,14,2.040920,El Mariachi,6.6,238,1992,Sep,Friday,Robert Rodriguez,NaN

In [64]:
data["sum"] = data[["revenue", "budget"]].apply(np.sum, axis = 1)

In [65]:
data.head()

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender,Sum,profit,sum
0,237.0,150,2787.965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,0.0,3024.965087,[2550.965087],3024.965087
1,300.0,139,961.000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,0.0,1261.000000,[661.0],1261.000000
2,245.0,107,880.674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,0.0,1125.674609,[635.674609],1125.674609
3,250.0,112,1084.939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,0.0,1334.939099,[834.9390989999999],1334.939099
4,258.0,115,890.871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,0.0,1148.871626,[632.871626],1148.871626

In [67]:
data["profit"] = data[["budget", "revenue"]].apply(np.diff, axis = 1)
data.head()

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender,Sum,profit,sum
0,237.0,150,2787.965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,0.0,3024.965087,[2550.965087],3024.965087
1,300.0,139,961.000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,0.0,1261.000000,[661.0],1261.000000
2,245.0,107,880.674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,0.0,1125.674609,[635.674609],1125.674609
3,250.0,112,1084.939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,0.0,1334.939099,[834.9390989999999],1334.939099
4,258.0,115,890.871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,0.0,1148.871626,[632.871626],1148.871626

In [68]:
def calProfit(x): 
    return x["revenue"] - x["budget"]

In [69]:
data["profit"] = data.apply(calProfit, axis = 1)
data.head()

,budget,popularity,revenue,title,vote_average,vote_count,year,month,day,director_name,gender,Sum,profit,sum
0,237.0,150,2787.965087,Avatar,7.2,11800,2009,Dec,Thursday,James Cameron,0.0,3024.965087,2550.965087,3024.965087
1,300.0,139,961.000000,Pirates of the Caribbean: At World's End,6.9,4500,2007,May,Saturday,Gore Verbinski,0.0,1261.000000,661.000000,1261.000000
2,245.0,107,880.674609,Spectre,6.3,4466,2015,Oct,Monday,Sam Mendes,0.0,1125.674609,635.674609,1125.674609
3,250.0,112,1084.939099,The Dark Knight Rises,7.6,9106,2012,Jul,Monday,Christopher Nolan,0.0,1334.939099,834.939099,1334.939099
4,258.0,115,890.871626,Spider-Man 3,5.9,3576,2007,May,Tuesday,Sam Raimi,0.0,1148.871626,632.871626,1148.871626